Revit 2027 API
CompoundStructure.GetLayerFunction Method
 Retrieves the function of the specified layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MaterialFunctionAssignment GetLayerFunction(
	int layerIdx
)
Public Function GetLayerFunction (
	layerIdx As Integer
) As MaterialFunctionAssignment
public:
MaterialFunctionAssignment GetLayerFunction(
	int layerIdx
)
member GetLayerFunction :
        layerIdx : int -> MaterialFunctionAssignment
Parameters
layerIdx Int32
 Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Return Value
MaterialFunctionAssignment
 The function of the layer.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The layer index is out of range.
Remarks
 The function determines how this layer interacts with the layers of other elements to which it is joined.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace